import { NavLink, useNavigate, useParams } from "react-router-dom";
import {decode} from 'html-entities';
import { useEffect, useState } from "react";
import React from 'react'
import { Helmet, HelmetProvider } from 'react-helmet-async';

// Mark Down
import MarkDown from "../components/MarkDown";

const About = props => {
    const navigate = useNavigate();

    const markdown = `Web Development ကို လေ့လာမည့် သူများအတွက် ရေးဆွဲထားခြင်းဖြစ်ပါတယ်။
လောလောဆယ်မှာ BFWD Course ပဲ့ရှိပါတယ်။ BFWD က Free Course ဖြစ်ပါတယ်။
သင်ခန်းစာများကို တစ်ခြားမည်သည့်နေရာများသို့ ကူးယူဖြန့်ဖြူးခြင်းမပြုလုပ်ကြရန် မေတ္တာရပ်ခံပါတယ်။
မည်သူ့အခကြေးငွေတစ်စုံတစ်ရာ ကောက်ခံခြင်းမရှိပါ။ ကူးယူဖြန့်ဖြူးခြင်းများရှိပါက ကျွန်တော်တို့၏ [Facebook Page](m.me/digitalhunter.io) သို့လာရောက်တိုင်ကြားနိုင်ပါတယ်။
### သင်ခန်းစာများကို ဘယ်လိုလေ့လာရမှာလဲ?
* တစ်နေ့ သင်ခန်းစာ (3) ပုဒ်နှုန်းဖြင့်လေ့လာပေးပါ။
* မိမိတစ်နေ့ လေ့လာပြီးသွားတဲ့ သင်ခန်းစာများကို မှတ်ထားပေးပါ။

****

## Motivitional Law

### Purpose
မည်သည့်ပညာရပ်ကိုမဆို စမ်းသက်သက်ကြီးလေ့လာတဲ့အခါ အဆင်မပြေမှုတွေ အခက်အခဲက ရှိစမြဲပါပဲ့။
ဘယ်လောက်ပဲ့ ခက်ခဲ ကြမ်းတမ်းပါစေ ရှေ့ဆက်ပြီးကြိုးစားဖို့လိုပါတယ်။ အဲ့ဒီအခက်အခဲကိုမှ မကျော်ဖြတ်နိုင်ရင် နောက်လာမယ့် အခက်အခဲအခက်တွေက
ဒီထက်ပိုပြီး ကြမ်းတမ်းကောင်းကြမ်းတမ်းနိုင်ပါတယ်။ ပြဿန်ာ သေးသေးကို အဆင်ပြေအောင်ဖြေရှင်းနိုင်မှသာလျှင် ပြဿနာကြီးတာတွေကို အလွယ်အတူဖြေရှင်းနိုင်မှာပါ။
အခက်အခဲ ပြဿနာကိုပြေးတွေ့ပါ။ ဒါမှသာလျှင် နောက်တစ်ခါ ဘယ်လိုဖြေရှင်းရမလဲဆိုတာ သိသွားပါတယ်။ ကိုယ်ကသာ လေ့လာနေတဲ့ ပညာရပ်ကိုချစ်မှသာလျှင် သူကလည်းကိုယ့်ကို
ပြန််လည်ချစ်မှာပါ။ တစ်ဖြည်းဖြည်းနဲ့ ရက်တွေ လတွေ ကြာလာတော့ အဆင်ပြေသွားပါလိမ့်မယ်။ ဇွဲမလျှောပဲ့ ဆက်သွားဖို့သာ အရေးကြီးဆုံးပါ။

### Concentrated Effort
တစ်ခုခုကို လုပ်ဖို့ဆုံးဖြတ်ချက်ချလိုက်တာနဲ့ ဖြစ်ကိုဖြစ်ရမယ်၊ တတ်ကိုတတ်ရမယ် ဆိုတဲ့ Serious (အလေးအနက်) ဖြစ်ဖို့လိုအပ်ပါတယ်။
ရန်သူကိုတိုက်ခိုက်တဲ့အခါ အဲ့ဒီရန်သူကို ကိုယ်က သူထွက်ပေါက်မရှိအောင် သေသေချာချာ အာရုံစူးစိုက်ပြီး တိုက်ခိုက်ရမှာပါ။ မဟုတ်ရင် ကိုယ်ချည်းခံနေရပါလိမ့်မယ်။
ဆိုလိုတာက အာရုံများ ပျံ့လွင့်မသွားပဲ စူးစူးစိုက်စိုက်လေ့လာဖို့မှာချင်တာပါ။ အချိန်တိုင်းလေ့လာရမယ်လို့ မပြောလိုပါဘူး။ အချိန်လေးတေ့သတ်မှတ်ထားဖို့လိုပါတယ်။
Internet ကနေ ဖိုင်များကို Download ချတဲ့အခါ ၉၅% မှာရပ်လိုက်တဲ့အခါ အစကနေ ပြန်ပြီး အသစ်ပြန်လည် စရတတ်ပါတယ်။
မည်သည့်ပညာရပ်ကိုမဆို ပြတ်တောက်ပြတ်တောက်လေ့လာဖို့အားမပေးပါဘူး။ လေ့လာရင် အကုန်အာရုံစိုက်ပြီးလေ့လာပါ။ လေ့လာလိုက်၊ ပစ်ထားလိုက်၊ ပြန်စလိုက်ဆိုရင်
အချိန်ကုန်လူပင်ပန်းပါတယ်။ Purpose လည်းမခိုင်မှ၊ Serious လည်းမဖြစ်၊ Concentrated Effort အားနည်းပြီး ဟိုသင်တန်းတက် ဒီသင်တန်းတက် ပြတ်တောက်ပြတ်တောက် လေ့လာလိုက် ပစ်ထားလိုက် နဲ့ဆိုရင်
အဆင်မပြေလှပါဘူး။ ဒီလိုနဲ့ နောက်တော့ လမ်းတွေပျောက်ပြီး လက်လျှော့လိုက်တာမျိုးတွေမြင်နေရတော့ စိတ်မကောင်းသလို၊ ရှေ့ဆက်ရမည့် မိမိအနာဂတ်၊ နိုင်ငံအတွက်လည်း အဆင်ပြေမှာမဟုတ်ပါဘူး။
**"အကောင်းဆုံးတွေ"** ဆိုတာ ပေးဆပ်မှု၊ အချိန်၊ ပြင်းပြင်းထန်ထန်လုပ်အားစိုက်ထုတ်မှုများလုပ်ပြီးမှ ထွက်ပေါ်လာတဲ့အရာပါ။ WE Can Do IT ပါ။

\`အဆင်ပြေကြပါစေဗျာ\` `

    return (
        <>
            <HelmetProvider>
                <Helmet>
                    <title>BFWD | About</title>
                </Helmet>
            </HelmetProvider>

            <div className="container mx-auto px-3 py-5 lg:px-10 2xl:px-32 lg:pt-9">
                <button onClick={() => navigate('/')} className="text-emerald-500 mb-5"><i className="fa-solid fa-angle-left"></i> Back</button>
                <div className="flex items-center space-x-3 mb-5">
                    <h1 className="m-0"></h1>
                </div>

                <MarkDown markdown={markdown}/>
            </div>
        </>
    )
}

export default About;